#pragma once

// PUBG MOBILE (4.5.0 -- 64bit Beta) SDK Generate By @ByDwoz
// Telegram Channel:- @XelahotOfficial
// Generate on Wed Jul  8 13:37:58 2026
 
namespace SDK
{
//---------------------❣︎➪ 𝗕𝗬𝗗𝗪𝗢𝗭 𝗗𝗘𝗩𝗘𝗟𝗢𝗣𝗘𝗥༆✈︎🇪🇬---------------------------
//Script Structs
//---------------------❣︎➪𝗕𝗬𝗗𝗪𝗢𝗭 𝗗𝗘𝗩𝗘𝗟𝗢𝗣𝗘𝗥༆✈︎🇪🇬---------------------------

// UserDefinedStruct BP_STRUCT_LevelUnLockGuideConfig_type.BP_STRUCT_LevelUnLockGuideConfig_type
// 0x00B8
struct FBP_STRUCT_LevelUnLockGuideConfig_type
{
	struct FString                                     DynamicVisibleWidget_0_64CB854040E5BEB536A56BAD07CBD414;  // 0x0000(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
	int                                                EntranceDisplayType_1_0C7C51800C1D097803590B720C4B9785;   // 0x0010(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               HandEffect_2_531679807BE8BBFA2B79229E0303F3B4;            // 0x0014(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x3];                                       // 0x0015(0x0003) MISSED OFFSET
	int                                                ID_3_1542CAC064C83B470A191DD9005BBF04;                    // 0x0018(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               Interruptible_4_1329A1C0021876C511E12D970F258B45;         // 0x001C(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x3];                                       // 0x001D(0x0003) MISSED OFFSET
	int                                                LobbyType_5_616B4E002019031A0DECEF930D22B035;             // 0x0020(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData02[0x4];                                       // 0x0024(0x0004) MISSED OFFSET
	struct FString                                     NewSignWidget_6_5E276F404764E0D37EBD73470A168E24;         // 0x0028(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
	bool                                               ShowFoldButtonNewSign_7_46A7DEC00495F0D36BE21B420E0FEBBE; // 0x0038(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData03[0x3];                                       // 0x0039(0x0003) MISSED OFFSET
	int                                                Step_8_35DEEE807DBED916445E13120BBE7A90;                  // 0x003C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                Style_9_66904BC0693A7B735887D53B0BE7BB95;                 // 0x0040(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                SystemID_10_30478C000CA9B2C227C4EF8E00F11F54;             // 0x0044(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FString                                     TargetRedPointWidget_11_34B0C3801132765E0A3EC9570A9E8464; // 0x0048(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     TargetUIConfig_12_683A9E4006450C197FB27C3A05543B17;       // 0x0058(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     TargetWidget_13_242B5A402E62C37359E99AC007A77BB4;         // 0x0068(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
	int                                                TipDirection_14_12821B0002FABD3A20657C0E063ABEEE;         // 0x0078(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                TipID_15_1CBB760033A47AE458A069830BE80164;                // 0x007C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FString                                     CallbackFunction_16_710CBC401EB227D7439F0FBB0372790E;     // 0x0080(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     GetWidgetFunction_17_24A63A004FB8D73640FCDB220017AC9E;    // 0x0090(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
	bool                                               FlashEffect_18_743276405B0D86B727A92497074EE684;          // 0x00A0(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData04[0x7];                                       // 0x00A1(0x0007) MISSED OFFSET
	struct FString                                     UIQueueParam_19_7115EC80563C1A22306AC06505E8580D;         // 0x00A8(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
};

}

